# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.

# Целое число
a = 5
b = 10
result = a + b
print(f'a={a}, b={b}, c=a+b={result}')
print(type(result))

# Дробное число
a = int(input('Введите число а: '))
b = int(input('Введите число b: '))
print(f'Частное a/b={a/b}')
print(type(a/b))

# Cтрока
name = input('Введите ваше имя: ')
print(f'Здравствуй {name}')
print(type(name))

# Булевые
a = int(input('Введите число а: '))
b = int(input('Введите число b: '))
print(f'a>b? {a>b}')
print(type(a>b))