# 3. Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3.
# Считаем 3 + 33 + 333 = 369.

a = input('Введите число: ')
print(type(a))
b = int(a * 2)
c = int(a * 3)
a = int(a)
result = a + c + b
print(f'{a}+{b}+{c}={result}')