# 6. Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить
# не менее b километров. Программа должна принимать значения параметров a и b
# и выводить одно натуральное число — номер дня.

result_start = int(input('Введите результат первого дня в километрах: '))
result_fin = int(input('Введите целевой результат в километрах: '))
step = 0.1
result = result_start
i = 1
while result <= result_fin:
    print(f'{i}-й день: {result}')
    result = round((result + step * result), 2)
    i += 1
print(f'{i}-й день: {result}')
print(f'На {i}-й день спортсмен достиг результат не менее {result_fin} километров')
