# 2. Пользователь вводит время в секундах. Переведите время в часы,
# минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

time_sec = int(input('Введите время в секундах: '))
time_min = time_sec // 60
sec = time_sec % 60
time_hour = time_min // 60
min = time_min % 60
print(f'{time_hour}:{min}:{sec}')