# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно
# добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

def my_sum (x):
    summa = 0
    for el in x:
        if el == 'q':
            break
        el = int(el)
        summa = summa + el
    return summa

data = (input('Введите строку чисел, разделенных пробелом: '))
data = data.split( )
res_summa = my_sum(data)
print(res_summa)
