# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
#
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


# Способ 1
def my_func1(x, y):
    num_degree = x ** y
    return num_degree
print(my_func1(3, 5))

# Способ 2
def my_func2(x, y):
    i = 1
    result = 1
    while i > 0 and i <= y:
        result = result * x
        i += 1
    return result
print(my_func2(3, 5))

