# 1. Реализовать функцию, принимающую два числа (позиционные аргументы)
# и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть
# обработку ситуации деления на ноль.

def my_div ():
    arg_1 = int(input('Введите делимое: '))
    arg_2 = int(input('Введите делитель: '))
    if arg_2 == 0:
        print('На ноль делить нельзя')
        return
    else:
        return arg_1 / arg_2

print(my_div())
